Tekla.Structures.ModelInternal.dotGuidList_t
Struct for transfering guids

Tekla.Structures.ModelInternal.dotGuidList_t.TransactionId
The transaction id

Tekla.Structures.ModelInternal.dotGuidList_t.totalNumber
Number of objects in total

Tekla.Structures.ModelInternal.dotGuidList_t.nObjects
Number of objects

Tekla.Structures.ModelInternal.dotGuidList_t.aObjectGuids
Guids